import friendly
friendly.install(lang="ru")

"""
Напишите программу вычисляющую объём и площадь поверхности шара.
Радиус шара вводится с клавиатуры.
"""

# вводим радиус и сразу преобразуем значение из строки в вещественное число функцией float()
r = float(input("Введите радиус сферы: "))

V = ... # TODO: запишите формулу вычисления объема шара

# TODO: переменной S присвойте вычисленное значение площади поверхности сферы
...

# TODO: с помощью f-строки выведите объём и площадь поверхности. Используйте один print()
...
