import friendly
friendly.install(lang="ru")

"""
Расстояние между двумя точками A и B координатной плоскости с соответствующими
координатами (x1, y1) и (x2, y2) рассчитывается по следующей формуле.
Напишите программу вычисляющую расстояние между двумя точками.
Координаты точек вводятся с клавиатуры.
"""

import math # импортируем библиотеку math

# TODO: в переменные запишите координаты с клавиатуры
x1 = ...
y1 = ...

x2 = ...
y2 = ...

# для вычисления квадратного корня используем функцию sqrt модуля math
L = math.sqrt(...) # TODO: вместо троеточия допишите формулу

# TODO: выведите расстояние между точками на экран в нужном формате
