import friendly
friendly.install(lang="ru")

"""
Общая стоимость пиццы определяется произведением её площади на стоимость 1 м^2 пиццы.
Рассчитайте общую стоимость пиццы по заданному радиусу (r) и стоимости 1 м^2 (price).
Радиус (r) и стоимость (price) вводятся с клавиатуры.
"""

# TODO: переменной r присвойте значение, введённое с клавиатуры. В переменной должно быть вещественное число.
...

# TODO: переменной price присвойте целое значение, введённое с клавиатуры
...

S = ... # TODO: вычислите площадь пиццы по радиусу

total_price = ... # TODO: присвойте переменной общую стоимость пиццы

# TODO: выведите общую стоимость
...
