import friendly
friendly.install(lang="ru")

"""
Даны две переменные A и B. Если их значения равны, то присвоить каждой переменной
сумму этих значений, а если не равны, то присвоить переменным нулевые значения.
Значения переменных A и B вводятся с клавиатуры.
Выведите новые значения переменных на экран.
"""

# вводит числа с клавиатуры
A = int(input("Введите число А "))
B = int(input("Введите число B "))

if ... : # TODO: проверьте равны ли A и B
    ... # TODO: присвойте A и B их сумму
else:
    ...